#include <iostream>
#include <vector>

int main()
{
  // ======================
  // Завдання 1
  // ======================
  int sum = 0;
  for (int i = 1; i <= 15; i += 2)
  {
    sum += i;
  }
  std::cout << "Сума непарних чисел від 1 до 15: " << sum << "\n\n";

  // ======================
  // Завдання 2
  // ======================
  std::vector<int> vec{1, 3, 5, 15, 16, 17, 18, 19, 20, 21, 25, 26, 27, 30, 50, 55, 56, 58, 100, 200, 300, 400, 500, 600, 700};
  int count = 0;
  for (int num : vec)
  {
    if (num % 3 == 0 || num % 5 == 0)
    {
      ++count;
    }
  }
  std::cout << "Кількість елементів, що діляться на 3 або 5: " << count << "\n";

  return 0;
}
